experiments/wrk2/wrk2-15/out.txt
Running 1m test @ http://192.168.1.2
  4 threads and 80 connections
  Thread calibration: mean lat.: 1615.728ms, rate sampling interval: 5615ms
  Thread calibration: mean lat.: 1556.645ms, rate sampling interval: 5525ms
  Thread calibration: mean lat.: 1634.817ms, rate sampling interval: 5705ms
  Thread calibration: mean lat.: 1628.520ms, rate sampling interval: 5718ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.76s     4.40s   19.17s    57.70%
    Req/Sec    44.47k   313.21    45.10k    66.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.78s 
 75.000%   14.57s 
 90.000%   16.84s 
 99.000%   18.28s 
 99.900%   18.66s 
 99.990%   19.02s 
 99.999%   19.17s 
100.000%   19.19s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2955.263     0.000000            2         1.00
    4665.343     0.100000       888873         1.11
    6176.767     0.200000      1776925         1.25
    7716.863     0.300000      2663397         1.43
    9248.767     0.400000      3552486         1.67
   10780.671     0.500000      4440937         2.00
   11542.527     0.550000      4881582         2.22
   12296.191     0.600000      5327049         2.50
   13049.855     0.650000      5769387         2.86
   13803.519     0.700000      6211938         3.33
   14573.567     0.750000      6659242         4.00
   14942.207     0.775000      6878525         4.44
   15335.423     0.800000      7102804         5.00
   15704.063     0.825000      7320631         5.71
   16080.895     0.850000      7543610         6.67
   16465.919     0.875000      7768889         8.00
   16646.143     0.887500      7875796         8.89
   16842.751     0.900000      7988733        10.00
   17039.359     0.912500      8102309        11.43
   17235.967     0.925000      8213857        13.33
   17432.575     0.937500      8328020        16.00
   17514.495     0.943750      8378888        17.78
   17612.799     0.950000      8436811        20.00
   17711.103     0.956250      8492456        22.86
   17809.407     0.962500      8548289        26.67
   17891.327     0.968750      8597509        32.00
   17940.479     0.971875      8623621        35.56
   18006.015     0.975000      8660220        40.00
   18055.167     0.978125      8685897        45.71
   18104.319     0.981250      8710446        53.33
   18169.855     0.984375      8741126        64.00
   18202.623     0.985938      8754688        71.11
   18235.391     0.987500      8767311        80.00
   18268.159     0.989062      8779154        91.43
   18300.927     0.990625      8790861       106.67
   18350.079     0.992188      8806379       128.00
   18366.463     0.992969      8810935       142.22
   18399.231     0.993750      8820201       160.00
   18431.999     0.994531      8827916       182.86
   18464.767     0.995313      8834958       213.33
   18481.151     0.996094      8838471       256.00
   18513.919     0.996484      8844701       284.44
   18530.303     0.996875      8847680       320.00
   18546.687     0.997266      8850732       365.71
   18563.071     0.997656      8853375       426.67
   18579.455     0.998047      8855725       512.00
   18595.839     0.998242      8858086       568.89
   18612.223     0.998437      8860201       640.00
   18628.607     0.998633      8861979       731.43
   18644.991     0.998828      8863492       853.33
   18661.375     0.999023      8864775      1024.00
   18677.759     0.999121      8865888      1137.78
   18694.143     0.999219      8866874      1280.00
   18710.527     0.999316      8867947      1462.86
   18710.527     0.999414      8867947      1706.67
   18726.911     0.999512      8868671      2048.00
   18743.295     0.999561      8869233      2275.56
   18759.679     0.999609      8869778      2560.00
   18776.063     0.999658      8870056      2925.71
   18792.447     0.999707      8870395      3413.33
   18825.215     0.999756      8870992      4096.00
   18841.599     0.999780      8871240      4551.11
   18841.599     0.999805      8871240      5120.00
   18890.751     0.999829      8871471      5851.43
   18939.903     0.999854      8871693      6826.67
   18972.671     0.999878      8871916      8192.00
   19005.439     0.999890      8872029      9102.22
   19021.823     0.999902      8872115     10240.00
   19038.207     0.999915      8872223     11702.86
   19070.975     0.999927      8872402     13653.33
   19087.359     0.999939      8872492     16384.00
   19087.359     0.999945      8872492     18204.44
   19103.743     0.999951      8872589     20480.00
   19103.743     0.999957      8872589     23405.71
   19120.127     0.999963      8872729     27306.67
   19120.127     0.999969      8872729     32768.00
   19120.127     0.999973      8872729     36408.89
   19136.511     0.999976      8872827     40960.00
   19136.511     0.999979      8872827     46811.43
   19136.511     0.999982      8872827     54613.33
   19152.895     0.999985      8872872     65536.00
   19152.895     0.999986      8872872     72817.78
   19152.895     0.999988      8872872     81920.00
   19169.279     0.999989      8872938     93622.86
   19169.279     0.999991      8872938    109226.67
   19169.279     0.999992      8872938    131072.00
   19169.279     0.999993      8872938    145635.56
   19169.279     0.999994      8872938    163840.00
   19169.279     0.999995      8872938    187245.71
   19169.279     0.999995      8872938    218453.33
   19169.279     0.999996      8872938    262144.00
   19169.279     0.999997      8872938    291271.11
   19185.663     0.999997      8872968    327680.00
   19185.663     1.000000      8872968          inf
#[Mean    =    10760.203, StdDeviation   =     4401.084]
#[Max     =    19169.280, Total count    =      8872968]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  434.00us
 75.000%  474.00us
 90.000%  642.00us
 99.000%    0.88ms
 99.900%    1.13ms
 99.990%    3.81ms
 99.999%    8.20ms
100.000%   15.53ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.071     0.000000            1         1.00
       0.273     0.100000       899601         1.11
       0.335     0.200000      1777555         1.25
       0.403     0.300000      2683222         1.43
       0.420     0.400000      3563571         1.67
       0.434     0.500000      4503920         2.00
       0.440     0.550000      4921533         2.22
       0.447     0.600000      5387343         2.50
       0.454     0.650000      5809787         2.86
       0.462     0.700000      6219931         3.33
       0.474     0.750000      6681980         4.00
       0.482     0.775000      6896525         4.44
       0.494     0.800000      7112314         5.00
       0.519     0.825000      7321426         5.71
       0.589     0.850000      7543456         6.67
       0.621     0.875000      7766802         8.00
       0.632     0.887500      7877127         8.89
       0.642     0.900000      7988226        10.00
       0.652     0.912500      8102898        11.43
       0.662     0.925000      8214192        13.33
       0.673     0.937500      8324747        16.00
       0.679     0.943750      8377919        17.78
       0.686     0.950000      8433279        20.00
       0.694     0.956250      8486473        22.86
       0.705     0.962500      8543381        26.67
       0.721     0.968750      8598287        32.00
       0.733     0.971875      8624478        35.56
       0.753     0.975000      8651499        40.00
       0.786     0.978125      8679459        45.71
       0.816     0.981250      8706836        53.33
       0.840     0.984375      8734691        64.00
       0.851     0.985938      8749012        71.11
       0.861     0.987500      8762455        80.00
       0.872     0.989062      8776743        91.43
       0.883     0.990625      8789914       106.67
       0.897     0.992188      8804511       128.00
       0.904     0.992969      8810877       142.22
       0.913     0.993750      8817981       160.00
       0.923     0.994531      8824529       182.86
       0.937     0.995313      8831651       213.33
       0.956     0.996094      8838485       256.00
       0.970     0.996484      8841884       284.44
       0.988     0.996875      8845316       320.00
       1.010     0.997266      8848722       365.71
       1.036     0.997656      8852253       426.67
       1.060     0.998047      8855694       512.00
       1.072     0.998242      8857409       568.89
       1.084     0.998437      8859108       640.00
       1.098     0.998633      8860918       731.43
       1.114     0.998828      8862632       853.33
       1.133     0.999023      8864354      1024.00
       1.146     0.999121      8865222      1137.78
       1.161     0.999219      8866051      1280.00
       1.182     0.999316      8866935      1462.86
       1.213     0.999414      8867781      1706.67
       1.255     0.999512      8868654      2048.00
       1.281     0.999561      8869080      2275.56
       1.313     0.999609      8869508      2560.00
       1.360     0.999658      8869936      2925.71
       1.492     0.999707      8870371      3413.33
       1.737     0.999756      8870802      4096.00
       2.042     0.999780      8871019      4551.11
       2.337     0.999805      8871237      5120.00
       2.751     0.999829      8871452      5851.43
       3.145     0.999854      8871669      6826.67
       3.383     0.999878      8871887      8192.00
       3.529     0.999890      8871994      9102.22
       3.861     0.999902      8872102     10240.00
       4.127     0.999915      8872211     11702.86
       4.299     0.999927      8872319     13653.33
       4.403     0.999939      8872427     16384.00
       4.455     0.999945      8872484     18204.44
       4.511     0.999951      8872535     20480.00
       4.587     0.999957      8872590     23405.71
       4.711     0.999963      8872645     27306.67
       4.851     0.999969      8872698     32768.00
       5.003     0.999973      8872726     36408.89
       5.443     0.999976      8872752     40960.00
       6.171     0.999979      8872779     46811.43
       6.959     0.999982      8872806     54613.33
       7.239     0.999985      8872833     65536.00
       7.423     0.999986      8872847     72817.78
       7.807     0.999988      8872860     81920.00
       8.147     0.999989      8872875     93622.86
       8.247     0.999991      8872887    109226.67
       8.431     0.999992      8872901    131072.00
       8.487     0.999993      8872908    145635.56
       8.695     0.999994      8872914    163840.00
       9.015     0.999995      8872921    187245.71
       9.783     0.999995      8872928    218453.33
      10.895     0.999996      8872935    262144.00
      11.087     0.999997      8872938    291271.11
      11.247     0.999997      8872941    327680.00
      11.911     0.999997      8872945    374491.43
      12.103     0.999998      8872948    436906.67
      12.383     0.999998      8872952    524288.00
      12.391     0.999998      8872953    582542.22
      12.431     0.999998      8872955    655360.00
      12.439     0.999999      8872957    748982.86
      12.479     0.999999      8872959    873813.33
      12.695     0.999999      8872960   1048576.00
      12.711     0.999999      8872961   1165084.44
      12.719     0.999999      8872962   1310720.00
      13.447     0.999999      8872963   1497965.71
      13.447     0.999999      8872963   1747626.67
      13.599     1.000000      8872964   2097152.00
      13.767     1.000000      8872965   2330168.89
      13.767     1.000000      8872965   2621440.00
      13.991     1.000000      8872966   2995931.43
      13.991     1.000000      8872966   3495253.33
      13.991     1.000000      8872966   4194304.00
      14.039     1.000000      8872967   4660337.78
      14.039     1.000000      8872967   5242880.00
      14.039     1.000000      8872967   5991862.86
      14.039     1.000000      8872967   6990506.67
      14.039     1.000000      8872967   8388608.00
      15.527     1.000000      8872968   9320675.55
      15.527     1.000000      8872968          inf
#[Mean    =        0.444, StdDeviation   =        0.148]
#[Max     =       15.520, Total count    =      8872968]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  10646800 requests in 1.00m, 8.52GB read
Requests/sec: 177447.91
Transfer/sec:    145.36MB